{
    "HOSP": {
        "name": "Hospital",
        "desc": "You wake up in an eerie hospital bed. \nThere is a window to your left \nand a door in front of you.",
        "exits": [{
            "exit": "WINDOW",
            "target": "HOSPW"

        }, {
            "exit":"DOOR",
            "target": "HOSPD"

        }],
        "items": []
    },

    "HOSPW":{
        "name": "WINDOW",
        "desc": "You see an abandoned city and below the window a parking lot.",
        "exits": [{
            "exit": "DOOR",
            "target": "HOSPD"

        }],
        "items": []
    },
    "HOSPD":{
        "name": "DOOR",
        "desc": "You made it to the hallway. \nInfront of you is the exit to the parking lot. \nThere is a strange noise coming from the room to your right. ",
        "exits": [{
            "exit":"PARKING LOT",
            "target": "PARKL"
        }, {
            "exit":"RIGHT",
            "target": "ZOMROOM"
        }],
        "items": [
            {
                "item": "BATON",
                "desc": "There is a baton leaning against the door.",
                "take": "You take the baton near the door."
             }
        ]
    },
    "ZOMROOM":{
        "name": "HOSPITAL ROOM",
        "desc": "You are attacked by a zombie like creature and die.",
        "exits": [],
        "items": []
    },
    "PARKL":{
        "name": "PARKING LOT",
        "desc": "You are outside of the hospital in the parking lot. The atmosphere feels off and the city is quiet. \nYou get in your car and drive towards home. \nYour house is ahead, there is a supermarket on the way.",
        "exits": [{
            "exit": "HOUSE",
            "target": "HOME"
        }, {
            "exit": "SUPERMARKET",
            "target": "STORE"
        }, {
            "exit":"NORTH",
            "target":"HOME"
        }],
        "items":[]
    },
    "HOME":{
        "name": "HOUSE",
        "desc": "As you drive through the city, there are signs of a massive emergency. \nThe tv is on when you arrive and you hear that there has been an outbreak that has caused the population to turn into zombies. \nYou have enough supplies to barricade your house, couldnt hurt to grab more. \nThere is a message over your radio saying a survior community is in the woods.",
        "exits": [{
            "exit":"BARRICADE",
            "target": "BUNKER"
        }, {
            "exit": "FOREST",
            "target": "FRST"
        }, {
            "exit": "SUPERMARKET",
            "target": "STORE"
        }],
        "items":[]

    },
    "FRST":{
        "name":"FOREST COMMUNITY",
        "desc":"You made it to the forest sanctuary. \nAfter months, the community has grown and \nthere are now teams who undergo missions to find the cure (you can help you know). \nWith all these missions, there is a need for a leader. ",
        "exits":[{
            "exit":"HELP",
            "target":"GOVTB"
        }, {
            "exit": "STAY",
            "target": "FRSTDEST"
        }],
        "items":[]

    },
    "GOVTB":{
        "name":"GOVENMENT FACILITY",
        "desc":"You decided to tag along on one of the missions. \nBeing the technical genius you are, you have to rig up the machine that administers the cure. \nThe mission is succssful. You helped saved the world!",
        "exits":[{
            "exit":"",
            "target":"WON"
        }]

    },
    "WON":{
        "name":"COMPLETE",
        "desc":"Thanks for playing.",
        "exits":[],
        "items":[]
    },
    "FRSTDEST":{
        "name":"COMMUNITY COLLAPSE",
        "desc":"Over the course of weeks, the lack of leadership too often causes a breakdown in social hierarchy. \nThe lax of security also causes a week boarder that leads to the infestation of zombies. The village is no more. ",
        "exits":[{
            "exit":[]
        }],
        "items":[]
    },
    "BUNKER":{
        "name":"BUNKER",
        "desc":"You had a bunker set up for this exact scenario. \n",
        "exits":[],
        "items":[{
            "item":"NOTE",
            "desc": "There is a note on the door.",
            "take": "Its a note from yourself saying. 'Dont forget to restock the bunker, you never know!' Uh oh. "        
        }]

    },
    "STORE":{
        "name": "SUPERMARKET",
        "desc": "The supermarket is in pretty bad shape,it had been ravaged. \nThere are also weird creatures roaming near the front of the store.  \nThere is an area in the back store for outdoor gear that could be useful. \nBackroom has even more stuff, just so you know.",
        "exits":[{
            "exit":"EXIT",
            "target": "STREET"
        }, {
            "exit":"BACK",
            "target": "STREET"
        }, {
            "exit":"BACKROOM",
            "target":"BACKROOM"
        
        }],
        "items":[{
            "item":"MACHETE",
            "desc":"There is a machete over with the gardening tools.",
            "take":"You take the machete off the wall."
        }, {
            "item":"FOOD",
            "desc":"Its a store, there's food.",
            "take":"You get some groceries, to take home with you."
        },{
            "item":"MEDICINE",
            "desc":"There is also all purpose medicine. I mean you were in a hospital for some unknown reason.",
            "take":"The day seems off, good to stock up right now."
        }]
    },
    "STREET":{
        "name":"CALLE",
        "desc":"Your back on the same street, your house isnt to far.",
        "exits":[{
            "exit":"NORTH",
            "target":"HOME"
        }],
        "items":[]
    },
    "BACKROOM":{
        "name":"STORAGE",
        "desc":"You got greedy which made you distracted, you were killed by one of the roaming creatures.",
        "exits":[{
            "exit":""
        }]
    }

}